package lesson03;

public class Main {
    public static void main(String[] args) {

    }

    /*
        1. Создать массив интов, заполнить его значениями Integer.MIN_VALUE.
        Поменять какие-то значения в массиве.
        Посчитать сколько элементов массива не равны Integer.MIN_VALUE.
        Таким образом получим сколько элементов менялось от первоначального.
        2. Составить массив из значимых годов Республики Татартсан (любые 20), добавить их в массив в рандомном порядке, написать метод, принимающий массив годов (интов) и возвращающий их в отсортированном порядке. Сортировку реализовать методом bubble sort (пузырьковая сортировка).
        Для тех кто осилил второе задание.
        3. Написать метод, который на вход принимает отсортированный массив годов (из 2-го задания) и произвольный год, возвращает boolean значение, которое означает наличие или отсутствие даты в переданном массиве. Читаем и используем binary search (бинарный поиск).
     */
}
